module.exports = { //侧边栏，路由
  "/01html相关/": ["", "html", "html5", "面试题.md"],
  "/02css相关/": ["","css基础","布局","BFC、浮动与清除浮动","水平垂直居中",
   "Bootstrap", "css3", "css预处理",
    "面试题.md"],
  "/03js相关/": ["", "02JS基础","03JS语法.md","04JS数据类型.md","05对象.md","06函数.md",
   "07Symbol.md", "08DOM.md","09BOM.md","10JS异步编程.md","11JS正则.md",
   "12JS设计模式.md", "13JS进阶.md", "14函数式编程.md","15Cookie,Session,Token,JWT",
   "16ES6","17V8引擎工作原理","18TypeScript","X.面试题"],

  "/04vue/": ["", "2Vue简介", "3Vue的安装", "4vue基础语法", "5Vue指令", "filter过滤器方法", "X.面试题.md"],
  "/05node/": ["", "npm","面试题.md"],
  "/06数据库/": ["", "SQL.md", "MongoDB.md", "面试题.md"],

  "/07数据结构/": ["", "数据结构", "面试题.md"],
  "/08算法/": ["", "面试题.md"],
  "/09计算机网络和浏览器/": ["", "OSI参考模型.md",  "http1.x和2.0的区别.md", 
    "浏览器","从输入url到得到html再到页面渲染以及针对性优化.md","面试题.md",],
  "/10操作系统/": ["", "操作系统.md", "Linux.md", "bash和shell","面试题.md"],

  "/11UNIAPP/": ["", "面试题.md"],
  "/12前端工程化/": ["", "前端模块化、组件化、前端工程化的区别","前端开发的模块化计划史",
   "WebPack", "WebPack原理与实践", 
   "面试题.md"],
  "/13前端安全/": ["", "面试题.md"],
  "/14VS-Code/": ["", "1.自定义代码片段","2.mac 使用code命令打开VSCode","3.quokka","快捷键.md","出现的问题",],
  "/15Chrome/": ["", "开发者工具.md", ],

  "/16Git/": ["", "Git", "yaml","开源协议", "Markdown借鉴","git相关问题",],

  "/17生词本/": ["", "字母排序基础单词", "缩写", "学习中遇到的生词.md","句子.md"],
  "/18实战问题/": ["", "1.mac显示项目树：tree命令", "2.语法糖", "3.软件发行版本分类.md", "4.strapi.md",
    "5.系统用户权限不足问题.md", "6.RESTful.md", "7.一台服务器部署多个Web项目.md", "8.各种报错.md",
    "9.Browsersync网页自动刷新", "10.爬取掘金、简书、CSDN上的markdown文章","11.gitalk",
    "12.绑定自己的域名到gitpages.md","13.MongoDB在Mac上连不上.md","14.hexo博客搭建.md",
    "15.IEEE754.md"
  ],
  "/19书籍阅读/": ["", "《了不起的Javascript工程师》笔记.md","《深入浅出Node.js》笔记.md" ],
  "/20项目/": ["", "1.md","2" ],
  "/总结/": ["", "面试题.md", "作息习惯方法.md","收藏.md"]


}