module.exports={//侧边栏，路由
    "/html相关/": ["", "html", "html5","面试题.md"],
    "/css相关/": ["", "css基础","css进阶", "css3", "css预处理","面试题.md"],
    "/js相关/": ["", "JS基础", "JS进阶", "ES6","TypeScript","面试题.md"],

    "/vue/": ["", "2Vue简介", "3Vue的安装","4vue基础语法","5Vue指令","6Vue的事件处理","X.面试题.md"],
    "/node/": ["","面试题.md"],
    "/数据库/": ["", "", "", "","面试题.md"],

    "/数据结构/": ["", "数据结构", "", "","面试题.md"],
    "/算法/": ["", "", "", "","面试题.md"],
    "/计算机网络和浏览器/": ["", "", "", "","面试题.md"],
    "/操作系统/": ["", "操作系统.md", "Linux.md", "面试题.md"],

    "/UNIAPP/": ["", "", "", "","面试题.md"],
    "/前端工程化/": ["", "WebPack", "WebPack原理与实践", "前端开发的模块化计划史", "前端模块化、组件化、前端工程化的区别","面试题.md"],
    "/前端安全/": ["", "", "", "","面试题.md"],
    "/VS-Code/": ["", "", "", "","面试题.md"],
    "/Chrome/": ["", "", "", "","面试题.md"],

    "/Git/": ["", "Git", "开源协议", "Markdown借鉴"],

    "/生词本/": ["", "字母排序基础单词", "", ""],
    "/实战问题/": ["", "1.mac显示项目树：tree命令", "2.语法糖", "3.软件发行版本分类.md","4.strapi.md","5.系统用户权限不足问题.md",
  "6.RESTful.md","7.一台服务器部署多个Web项目.md"
  ],
    "/书籍阅读/": ["","《了不起的Javascript工程师》笔记.md", ],
    "/项目/": ["", "", "", ""],

    "//": ["", "", "", ""],
    "//": ["", "", "", ""],

  }