module.exports = { //侧边栏，路由
  "/01html相关/": ["", "html", "html5", "面试题.md"],
  "/02css相关/": ["","css基础","布局","BFC、浮动与清除浮动","水平垂直居中",
   "Bootstrap", "css3", "css预处理",
    "面试题.md"],
  "/03js相关/": ["", "JS基础","JS数据类型","JS语法","JS正则.md",
   "DOM", "BOM","JS异步编程","JS设计模式",
   "ES6", "TypeScript", "面试题.md"],

  "/04vue/": ["", "2Vue简介", "3Vue的安装", "4vue基础语法", "5Vue指令", "6Vue的事件处理", "X.面试题.md"],
  "/05node/": ["", "面试题.md"],
  "/06数据库/": ["", "SQL.md", "MongoDB.md", "面试题.md"],

  "/07数据结构/": ["", "数据结构", "面试题.md"],
  "/08算法/": ["", "面试题.md"],
  "/09计算机网络和浏览器/": ["", "OSI参考模型.md", "面试题.md", "http1.x和2.0的区别.md", "从输入url到得到html再到页面渲染以及针对性优化.md"],
  "/10操作系统/": ["", "操作系统.md", "Linux.md", "bash和shell","面试题.md"],

  "/11UNIAPP/": ["", "面试题.md"],
  "/12前端工程化/": ["", "WebPack", "WebPack原理与实践", "前端开发的模块化计划史", "前端模块化、组件化、前端工程化的区别", "面试题.md"],
  "/13前端安全/": ["", "面试题.md"],
  "/14VS-Code/": ["", "快捷键.md"],
  "/15Chrome/": ["", "开发者工具.md", ],

  "/16Git/": ["", "Git", "开源协议", "Markdown借鉴","git相关问题",],

  "/17生词本/": ["", "字母排序基础单词", "缩写", "学习中遇到的生词.md"],
  "/18实战问题/": ["", "1.mac显示项目树：tree命令", "2.语法糖", "3.软件发行版本分类.md", "4.strapi.md",
    "5.系统用户权限不足问题.md", "6.RESTful.md", "7.一台服务器部署多个Web项目.md", "8.各种报错.md",
    "9.Browsersync网页自动刷新", "10.爬取掘金、简书、CSDN上的markdown文章","11.gitalk"
  ],
  "/19书籍阅读/": ["", "《了不起的Javascript工程师》笔记.md", ],
  "/20项目/": ["", "1.md","2" ],
  "/总结/": ["", "疑问.md", "收藏.md"]


}